# -*- coding: utf-8 -*-
'''
Задание 4.8

Преобразовать IP-адрес в двоичный формат и вывести на стандартный поток вывода вывод столбцами, таким образом:
- первой строкой должны идти десятичные значения байтов
- второй строкой двоичные значения

Вывод должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов

Пример вывода для адреса 10.1.1.1:
10        1         1         1
00001010  00000001  00000001  00000001

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

ip = '192.168.3.1'
ip = ip.split('.')
ip1, ip2, ip3, ip4 = (ip)
print(f'''
{ip1:10}{ip2:10}{ip3:10}{ip4:10}
{int(ip1):<10b}{int(ip2):<10b}{int(ip3):<10b}{int(ip4):<10b}''')
